{"pageProps":{"data":{"post":{"title":"How to check your wordpress sites security with WPScan","date":"2020-01-09","status":"publish","permalink":"/notes/how-to-check-your-wordpress-sites-security-with-wpscan","author":"Ehsan","excerpt":"","type":"post","id":1373,"thumbnail":"../uploads/2020/01/article.psd.jpg","category":["Lab"],"tag":["security","Wordpress"],"post_format":[]},"prevPost":{"title":"Getting started with React Native","date":"2020-01-14","status":"publish","permalink":"/notes/getting-started-with-react-native","author":"Ehsan","excerpt":"","type":"post","id":1431,"thumbnail":"../uploads/2020/01/IMG_1807.jpg","category":["Lab","Mobile"],"tag":[],"post_format":[]},"nextPost":{"title":"Journey to Cybersecurity Introduction","date":"2020-01-10","status":"publish","permalink":"/notes/journey-to-cybersecurity-introduction","author":"Ehsan","excerpt":"","type":"post","id":1387,"thumbnail":"../uploads/2020/01/lostpackets-1.jpg","category":["Lab"],"tag":["Cybersecurity","security"],"post_format":[]}},"content":"\nWPScan is a black box WordPress vulnerability scanner that can be used to scan remote WordPress installations to find security issues.You can use it to find vulnerability and brute forcing.\n\nDownload WPScanfrom github:  \nhttps://github.com/wpscanteam/wpscan/\n\n### WPScan update\n\nStart with the following command to update the WPScan vulnerabilities database:\n\n```\nwpscan –update\n```\n\n### Scanning WordPress vulnerabilities\n\nAfter updating the vulnerability database use the following command to scan the target website for the most popular and recent vulnerabilities:\n\n```\nwpscan –url [wordpress url]\n```\n\nYou will get the WordPress version, used theme and vulnerabilities in red if WPScan can finds any.\n\n### How to enumerate WordPress users\n\nThe WordPress user enumeration tool is used the retrieve a list of registered WordPress users for the target host. User enumeration is the first step when an attacker wants to gain access to a specific target by brute forcing. The enumeration tool scans the target on posts, pages and custom types for authors and usernames.\n\nUse the following command to enumerate the WordPress users:\n\n```\nwpscan –url [wordpress url]–enumerate u\n```\n\n### How to brute force the root password\n\nThere are many different tools out there for brute forcing like hydra here is how you do it with wpscan\n\nUse the following command to brute force the password for user root:\n\n```\n wpscan –url [wordpress url]–wordlist [path to wordlist]–username [username to brute force]–threads [number of threads to use]\n```\n\n### using Tor with wpscan to avoid getting your ip banned\n\n```\nwpscan --url example.org --proxy socks5://127.0.0.1:9050\n```\n\n### How to avoid WordPress User Enumeration\n\nIf you want to avoid WordPress user enumeration, you should avoid using the username as nickname and display name which is shown publicly in WordPress. The best option is to choose an administrator username which consists of random characters and use a different nickname. WPScan scans for usernames in the URL’s so if you won’t use the username it cannot be scanned by WPScan. Another way to prevent user enumeration is to use a different account to publish posts and answer to replies.\n\n### How to avoid Wordpres password brute forcing\n\nThe best way to keep attackers using brute force methods out is to limit the login attempts for and IP address. There are several plug-ins available for WordPress to limit the number login attempts for a specific username and IP, such as Wordfence. The latest WordPress versions have the option to limit login attempts by default. Make sure you limit entries to a maximum of 3 and increase lock out time a lot after 2 lock outs (which is 6 password attempts).\n"},"__N_SSG":true}